[
  {
    "id": "135_2346639.txt",
    "text": "Growing Dahlias. It's easy.\nGrowing Dahlias. It's easy.\nBilling Policies\nGrowing Dahlias. It's easy.\nFinally, all of your dahlia growing questions answered in one place! Scroll down to find planting instructions, staking advice, end-of-season care, proper tuber storage, and more. Or, watch our easy-to-follow dahlia planting video.\nAll About Growing Dahlias\nAn Addiction to Dahlias: The  Easy Way to Fantastic Flowers\nMy No.1 favorite dahlia, the magnificent 'Crazy Love' .\nBy Ray Allen, Founder of AmericanMeadows.com Photos by Don Paulson Photography\nA gardening expert once said of Dahlias, \"\"Never have so many enjoyed so much with so little time and work.\"\" And he was right.   There's probably no plant in the flower kingdom that gives the gardener a more spectacular reward than the dahlia.\nDahlias are a little like roses, or hostas, or even tomatoes. Most gardeners can't grow just one.  Once you grow a Dahlia, you want more. And like roses, hostas, and tomatoes, there are seemingly endless dahlias to keep a Dahlia gardener happy.  Growing them is remarkably easy, which only adds to the frenzy.  If you've never grown a Dahlia, it's high time you did.\nTubers, Not Bulbs\nEven though  they're often called bulbs, the roots of Dahlias are actually tubers (as in tuberous begonia). Dahlia tubers look a lot like a bunch  of brown carrots, and the stems sprout directly from the tubers - the little budding  sprouts that end up as thick strong stems are called \"\"eyes.\"\"\n \nSoil Prep, Food and Fertilizer\nDahlias respond dramatically to feeding.  After all, they are making these fat potato-like  roots, and the more food they get, the more root mass they'll make.  This not  only increases your growth of leaves and flowers, it also increases your tuber clump  for an even bigger show the following summer.\nSo be sure to dig your holes deep and work the soil all around.  Enrich  the soil with compost or well-rotted manure, and then work in a good organic fertilizer according to the instructions.  With a well-prepared soil  bed, your Dahlias will create beautiful growth very quickly.\nAfter frosts, it's time to plant. Tubers from last summer are ready to go back into the ground.\nThe soil for each hole is worked well, and since these are big dahlias, a stake is put into place early on.\nWe're planting three clumps of tubers per hole.  (Each will result in a large plant.)\nOur large dahlia garden is planted and fertilized. Now all we need is regular watering and a few weeks. See below.\nDahlia Spacing and Planting\nOnce you have your  tubers, it's important to space them correctly. If you're planting a big Dinnerplate  Dahlia, it will need room. When grown (and that's quickly) it'll be the size of a large  rose bush, so plan accordingly.  Follow the instructions on your package, but  in general, dig the hole in full sun in 'good garden soil' near a water source,  and place the tuber in arranging the 'bunch of carrots' with the points facing down. Simply firm the  soil around and over the clump, water well, and you're done.\nStaking Dahlias\nIf you're growing big dahlia plants, staking will be important.  The beautiful foliage grows on somewhat  brittle stems, and oftentimes heavy rain, wind or even the weight of the flowers once they've opened can break the plant.  You don't want that to happen, especially at bloom time, so set one or two stout stakes beside each tuber after  you plant them, and have the twine or 'twist-ems' ready to support the stems as  they grow.  Don't ignore this instruction.  Believe me, it's worth it. With a little effort, the stakes will be completely hidden by the leaves, but your  plant is going to need them.\nStakes can be placed at planting time.\nOr, stakes can be placed after plants have grown in.\n \nDisbudding Dahlias\nYou'll read about this in  most gardening books, and it applies to two things about dahlias.  Some experts  suggest removing the first buds which helps the plant take on a better form.  But who can do that and delay the first bloom?  It isn't really necessary.\nThe second definition refers only to the dinnerplates, and then only if you are growing for competition in flower shows. It amounts to this:   Like many flowers, dahlias set buds with one large one at the tip of a growing stem (the terminal bud),  and then smaller buds to the left and right of the tip, usually called lateral buds.  Disbudding involves removing all but the terminal bud while the buds are small,  effectively throwing all of the plant's growth energy into the one remaining bud.  While this practice can make a single flower bigger than big, most gardeners aren't growing their dahlias for  flower shows, so most people don't do it. (See An Unforgettable Flower Show  Memory below.)\nCutting Dahlia Flowers\nYou simply won't be  able to resist.  When you remove flowers for your arrangements, choose whole stems and try to maintain the basic shape of your plant.  It will quickly try  to replace the branch you remove, and the buds will keep coming - right up until frost.\n \n \nGrowing Dahlias in the Beginning: the Original Dahlia, and the Black Dahlia\nThe thousands of dahlias we see today are all hybrids from one ragged wildflower that's native to Mexico.  The Dutch hybridizers got their hands on it years ago, and were thrilled at how easily it took to various crosses, changes and \"\"improvements.\"\" Today there are cactus-flowered dahlias, water-lily dahlias, peony-flowered dahlias,  daisy dahlias - the parade is endless,  with new color combinations introduced every year.  Most of the larger ones, officially called \"\"Decorative\"\" (not dinnerplate) Dahlias,  are bi-colors or tri-colors, adding to the list of options for color and form. (See the complete list of the Twelve Official Classifications of Dahlias at the bottom of this article.)\nBut sorry, there is no Black Dahlia.  That's pure Hollywood,  the nickname of a famous starlet who was murdered.  Look for the Black Dahlia  in Hollywood history, not at the garden center.\nThe Twelve Official Divisions of Dahlias\nIf you're the type gardener who likes detail and \"\"official' information, here  it is. Like everything else, there are correct names and categories for all dahlia hybrids. The Netherland Flower Bulb Information Center lists the official divisions.  The big Dinnerplates are in Division 5, and the trend is toward shorter plants with  more and more colorful blooms. (See the latest types at the bottom of the list.)\nIt's interesting that the tubers of the 5-foot plants in Division 5 and 8 are  not that much bigger than those for the bedding dahlias that grow only about 18'  tall. All dahlia roots look about the same; all have the brown, swollen-carrot look.  Once they're out of the ground and the tops are cut off, it's hard to tell the various  types apart.\nSingle-flowering Dahlias\nThese are some of the oldest types,  rarely seen today, and look much like a large daisy or cosmos . Simple, sweet, and charming. Difficult to find at retail nurseries and big box stores. Plants grow 16-24'  tall.\nAnemone-flowering Dahlias\nThese are the beautiful single flowers with one or more rings of florets, but not really 'double.' Resemble Anemone, the famed Greek 'wind flower'. The central group of petals is tubular. Height: 24 to 48 in.\nDecorative\nDahlias\nThis group includes the big ones, such as the \"\"Dinnerplate Dahlias'. Flowers are fully double and the plants are tall. Flower size is the largest, up to 12 inches across.  Plants grow up to 60' (5 feet) tall.\nBall\nDahlias\nThe flowers for these are rounded, like a ball.  They resemble some larger double zinnias , but with richer colors. Loaded with petals, these flowers are mid-sized on plants to 48 in.\n \nPom Pom Dahlias\nThese popular dahlias are also ball-shaped,  usually perfectly round. They have smaller flowers than the 'Ball Dahlias' and look charming in a vase or handheld bouquet (popular with brides!). 32-48  in. tall.\nCactus Dahlias\nThese are unique, and carry blooms very similar  to cactus flowers. That means they're fully double, and have tubular petals that  are pointed, giving a starburst appearance. This group includes some spectacular  color combinations. Big plants, to 60 in. tall.\nSemi-Cactus Dahlias\nThis group is similar to the Cactus Dahlias, but the petals are not completely 'Involute' (tubular) and pointed. They have a less spiky and slightly softer appearance. Great at maintaining their shape throughout harsh weather.\nPeony Dahlias\nThe name says it all. These dahlias imitate the fully double, fluffy look of a classic peony , making them a great choice for growing within a shorter time frame. 35' plants.\n \nCollarette Dahlias\nThis group is also daisy-like, but the  other ring of petals is flat, while the inner ring is ruffled, creating the 'collar.'  These are mid-sized dahlias, on mid-size plants, only 30 to 48 in. tall.\nWater-lily Dahlias\nThese are some of the most beautiful.  Like the name implies, the large flowers resemble the spectacular bloom of a waterlily.  Flowers are fully double, but still flattened in shape. Up to  48 in.\nMignon Dahlias\nThese are the small 'bedding dahlias' with  single or semi-double daisy flowers in striking colors. Flowers are only 3-4 in. wide, and plants top out at 28\"\", making them great for planters, patio pots and window-boxes.\nTopmix Dahlias\nMore small bedding dahlias like the Mignons  above. Roughly the same size, perhaps a bit smaller. These small bedding plants are also perfect for containers, and will produce abundant blooms.\n   \nThe Latest in Dahlias: The Dahlianovas, the Gallery Series, and the Impression Dahlias\nRecent hybridizing has resulted in all sorts of shorter dahlias with many of the glamorous qualities of the older, taller ones. The Dahlianova Dahlias have double flowers like the giants, but grow only 8 to15 in. tall. The Gallery Series is mid-sized, 12 to 14 in. with double, often bi-colored flowers that echo the colors  of famous painters. For example, there are Gallery Dahlias named ' Rembrandt ' and  'Leonardo.' The Impression Series is a little larger, growing to 12-20 inches, and  the flowers are of the classic 'collarette' type in very hot new color combinations. The Dutch hybridizers, who have learned a lot about marketing over the years, have named this group with a Spanish flair, and for some reason, all the names begin with 'F'. Examples are 'Impression Fuego', Impression 'Festivo', and Impression 'Futuro'.\nAn Unforgettable Flower Show Memory\nYears  ago, when I was a young person working in New York City, a friend in my office mentioned  that the New York Botanical Garden was having a big show of dahlias in bloom. He had read about it in the newspaper, and was going to see them on his lunch hour. He wondered if I'd like to go.\nAt this point in my life, gardening was not high on my interest list, and I had never seen a dahlia. But the idea fascinated me, and having  never been to the famous NY Botanical Garden, I agreed to go. And I've  never regretted it.\nAfter a gritty subway ride from Manhattan up to the Bronx where  the garden is located, we entered the famous institution through an elaborate entrance.   In the distance, I caught sight of the grandiose Victorian greenhouse I'd seen in  pictures, and we walked past an incredible pond with gigantic lotus blossoms in  bloom - something else I'd never seen.\nBut around a turn on the pathway, we entered a circular lawn. It must have been about 100 feet in diameter, a perfect circle enclosed in a perfectly  trimmed, high curving hedge.  And in front of the hedge, dahlias.  Each  plant was six feet tall or more, staked straight with almost no side branches, and  at the top of each, one huge, perfect flower. These gigantic blooms were all at least 12 inches across, and were there in stunning solid colors and rainbows of bi and tri-colors. They were literally explosions of color, each held high  and directly facing us as we walked around the circle. Spotlights of beauty. Stunning  natural masterpieces, coaxed into perfection by talent and dedication.  They were truly breathtaking.\nI now appreciate the weeks and weeks of feeding, clipping, disbudding, and staking that went into that show at the New York Botanical Garden. In the years since, I've grown a lot of dahlias, but never in that spectacular, formal  way.  But it is certainly a memory no gardener would never forget.\nWhat are you waiting for? Now you know all you need to know to  grow beautiful dahlias .  Each year, we offer the tubers on advance sale for  spring which begins in December.  If you order then, you'll save a bundle,  and your tubers will arrive at the proper planting time for your area. Enjoy!\nDahlias are always available for fall arrangements, along  with the last roses and whatever else is left in the garden. The dahlias at the top of the arrangement, with the pointed petals, are Cactus Dahlias. (Photo by Don Paulson.)\"\n"
  },
  {
    "id": "135_2039928.txt",
    "text": "Movie Review Wall Street 2: Money Never Sleeps\nMovie Review Wall Street 2: Money Never Sleeps\nBy ortiveztm on September 29, 2010\nAnthony Guerrero\nThe Paw Print\nThis decent sequel comes twenty-three years after the original 1987's Wall Street. It is the first time director Oliver Stone has made a sequel to one of his films. The film most noticeably stars Michael Douglas in a reprise of his role as Gordon Gekko for which he won an Academy Award and Shia Lebouf as Gekko's new son-in-law, Jacob Moore.  There is also a short cameo by Charlie Sheen who is best known for his role on Two and a Half Men.  \nThis film is centered around the 2008 financial crisis. Gekko is fresh from a long stint in prison and is on a book tour. He then meets his son-in-law and forms a deep bond between both of them, hoping to rekindle his fractured relationship with his daughter Winnie. Winnie is cautious and not optimistic about the future of the new family's relationship. Gekko soon becomes Jacob's new mentor, after the apparent suicide of his closest confidant and helps him to plot and successfully carry out revenge against the guilty man. Gekko teaches Moore many of his methods of making money.  There are many brilliant quotes in this film which makes the dialogue very rich. However, Gordon Gekko is still an unethical sleaze ball, and Jacob and Winnie soon find themselves victims of another one of his schemes. The climax of the film is at this moment, and the audience and characters wonder if Gekko's greed or small sense of moral values will prevail.\nWhile the cast of this movie is extraordinary, and Michael Douglas' performance is still one to be remembered and admired, the audience will feel satisfied that they were quickly entertained, but for such a brilliant cast and plot potential they will also feel the two hour film could have been a lot better. There are parts of the movie which tend to be quite boring and complex. Wall Street and banking terms are overly simplified through the use of cliche imagery. It is a good movie to see if you are interested in the banking industry and are well-versed in its terminology. It will not be the greatest movie you've ever seen, but it certainly will not be the worst.\"\n"
  }
]